package sec02.exam01;

public class D0816_자동타입변환 {

	public static void main(String[] args) {

		/*
		 * -> 기본타입과 마찬가지로 클래스도 타입변환 가능 이를 활용하면 객체 지향 프로그래밍의 다형성을 구현 가능
		 * 
		 * # 다형성 : 사용 방법은 동일하지만 다양한 객체를 이용해서 다양한 실행결과가 나오도록 하는 성질 : 다형성을 구현하려면 -> 메소드
		 * 재정의 + 타입 변환이 필요함
		 * 
		 * # 자동타입변환 : 타입변환 -> 다른 타입으로 변환하는 행위 개념 : 프로그램 실행 도중 자동적으로 타입 변환이 일어나는 것 클래스
		 * 타입변환 -> 상속 관계에 있는 클래스 사이에서 발생함 -> 자식은 부모 타입으로 자동 타입 변환이 가능함
		 * 
		 * # 클래스 자동 타입 변환 방법 부모타입 변수 = 자식타입; -> 부모 타입의 변수를 선언하고 자식타입의 객체를 부모 타입의 변수에 대입
		 */

	}

}
